In [1]:
import numpy as np
import pandas as pd

In [2]:
num = range(1, 100, 7)
pd.Series(num)

0      1
1      8
2     15
3     22
4     29
5     36
6     43
7     50
8     57
9     64
10    71
11    78
12    85
13    92
14    99
dtype: int64

In [3]:
string = "Hi", "How", "Welcome", "Anything", "to", "Write"
pd.Series(string)

0          Hi
1         How
2     Welcome
3    Anything
4          to
5       Write
dtype: object

In [4]:
st = pd.Series([373, 'Saudi Arabia', 37.3, 'Riyadh', -73.3])
st

0             373
1    Saudi Arabia
2            37.3
3          Riyadh
4           -73.3
dtype: object

In [5]:
obSt = pd.Series([[st], [num], [string], 37.3, 'Riyadh', -73.3])
obSt

0           [[373, Saudi Arabia, 37.3, Riyadh, -73.3]]
1    [(1, 8, 15, 22, 29, 36, 43, 50, 57, 64, 71, 78...
2            [(Hi, How, Welcome, Anything, to, Write)]
3                                                 37.3
4                                               Riyadh
5                                                -73.3
dtype: object

In [6]:
marks = [60, 70, 80, 90, 100]

subject = ["Math", "Science", "Programming", "English", "Religion"]

pd.Series(marks, index=subject)

Math            60
Science         70
Programming     80
English         90
Religion       100
dtype: int64

In [7]:
data = {"Math": 60, "Science": 70, "Programming": 90, "English": 80, "Religion": 100}
pd.Series(data)

Math            60
Science         70
Programming     90
English         80
Religion       100
dtype: int64

In [8]:
subject = ["Math", "Science", "Python", "English", "Religion"]
dataSubject = pd.Series(data, index=subject)
dataSubject

Math         60.0
Science      70.0
Python        NaN
English      80.0
Religion    100.0
dtype: float64

In [9]:
dataSubject.isnull()

Math        False
Science     False
Python       True
English     False
Religion    False
dtype: bool

In [10]:
dataSubject.notnull()

Math         True
Science      True
Python      False
English      True
Religion     True
dtype: bool

In [11]:
dataSubject[dataSubject > 75]

English      80.0
Religion    100.0
dtype: float64

In [12]:
dataSubject["Python"] = 68
dataSubject

Math         60.0
Science      70.0
Python       68.0
English      80.0
Religion    100.0
dtype: float64

In [13]:
dataSubject.Science == 20

np.False_

In [14]:
values = pd.Series([23, 45, np.nan, 41, 23, 34, 55, np.nan, 34, 20])
values

0    23.0
1    45.0
2     NaN
3    41.0
4    23.0
5    34.0
6    55.0
7     NaN
8    34.0
9    20.0
dtype: float64

In [15]:
values.sort_values(ascending=False)

6    55.0
1    45.0
3    41.0
5    34.0
8    34.0
0    23.0
4    23.0
9    20.0
2     NaN
7     NaN
dtype: float64

In [16]:
string_values = pd.Series(["H", "A", "Z", "A", "T", "I"])
string_values

0    H
1    A
2    Z
3    A
4    T
5    I
dtype: object

In [17]:
string_values.sort_values(ascending=True)

1    A
3    A
0    H
5    I
4    T
2    Z
dtype: object

In [18]:
dataSubject.rank(ascending=True, pct=False)

Math        1.0
Science     3.0
Python      2.0
English     4.0
Religion    5.0
dtype: float64

In [19]:
data = { 'Subject': ['Maths', 'Science', 'Python', 'English', 'Religion', 'Java'],
         'Marks': (78, 89, 79, 65, 77, 99),
         'CGPA': [3.5, 4, 5, 2.5, 3.5, 5]}

df = pd.DataFrame(data)
df

    Subject  Marks  CGPA
0     Maths     78   3.5
1   Science     89   4.0
2    Python     79   5.0
3   English     65   2.5
4  Religion     77   3.5
5      Java     99   5.0

In [20]:
Subject = pd.Series(['Maths', 'Science', 'Python', 'English', 'Religion', 'Java'])
Marks = pd.Series([78, 89, 79, 65, 77, 99])
CGPA = pd.Series([3.5, 4, 5, 2.5, 3.5, 5])

In [21]:
GatherData = pd.DataFrame([Subject, Marks, CGPA], index=['Subject', 'Marks', 'CGPA'])
GatherData

             0        1       2        3         4     5
Subject  Maths  Science  Python  English  Religion  Java
Marks       78       89      79       65        77    99
CGPA       3.5      4.0     5.0      2.5       3.5   5.0

Use T to Vertical dataframe

In [22]:
GatherData = pd.DataFrame([Subject, Marks, CGPA], index=['Subject', 'Marks', 'CGPA']).T
GatherData

    Subject Marks CGPA
0     Maths    78  3.5
1   Science    89  4.0
2    Python    79  5.0
3   English    65  2.5
4  Religion    77  3.5
5      Java    99  5.0

In [23]:
data = pd.read_csv("data.csv")
data.head(3)

,person_age,person_gender,person_education,person_income,person_emp_exp,person_home_ownership,loan_amnt,loan_intent,loan_int_rate,loan_percent_income,cb_person_cred_hist_length,credit_score,previous_loan_defaults_on_file,loan_status
0,22.0,female,Master,71948.0,0,RENT,35000.0,PERSONAL,16.02,0.49,3.0,561,No,1
1,21.0,female,High School,12282.0,0,OWN,1000.0,EDUCATION,11.14,0.08,2.0,504,Yes,0
2,25.0,female,High School,12438.0,3,MORTGAGE,5500.0,MEDICAL,12.87,0.44,3.0,635,No,1

In [24]:
type(data)

pandas.core.frame.DataFrame

In [25]:
data.shape

(45000, 14)

In [26]:
data.isnull().sum()

person_age                        0
person_gender                     0
person_education                  0
person_income                     0
person_emp_exp                    0
person_home_ownership             0
loan_amnt                         0
loan_intent                       0
loan_int_rate                     0
loan_percent_income               0
cb_person_cred_hist_length        0
credit_score                      0
previous_loan_defaults_on_file    0
loan_status                       0
dtype: int64

No null in the data

In [27]:
data.describe()

,person_age,person_income,person_emp_exp,loan_amnt,loan_int_rate,loan_percent_income,cb_person_cred_hist_length,credit_score,loan_status
count,45000.000000,4.500000e+04,45000.000000,45000.000000,45000.000000,45000.000000,45000.000000,45000.000000,45000.000000
mean,27.764178,8.031905e+04,5.410333,9583.157556,11.006606,0.139725,5.867489,632.608756,0.222222
std,6.045108,8.042250e+04,6.063532,6314.886691,2.978808,0.087212,3.879702,50.435865,0.415744
min,20.000000,8.000000e+03,0.000000,500.000000,5.420000,0.000000,2.000000,390.000000,0.000000
25%,24.000000,4.720400e+04,1.000000,5000.000000,8.590000,0.070000,3.000000,601.000000,0.000000
50%,26.000000,6.704800e+04,4.000000,8000.000000,11.010000,0.120000,4.000000,640.000000,0.000000
75%,30.000000,9.578925e+04,8.000000,12237.250000,12.990000,0.190000,8.000000,670.000000,0.000000
max,144.000000,7.200766e+06,125.000000,35000.000000,20.000000,0.660000,30.000000,850.000000,1.000000

In [28]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45000 entries, 0 to 44999
Data columns (total 14 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   person_age                      45000 non-null  float64
 1   person_gender                   45000 non-null  object
 2   person_education                45000 non-null  object
 3   person_income                   45000 non-null  float64
 4   person_emp_exp                  45000 non-null  int64
 5   person_home_ownership           45000 non-null  object
 6   loan_amnt                       45000 non-null  float64
 7   loan_intent                     45000 non-null  object
 8   loan_int_rate                   45000 non-null  float64
 9   loan_percent_income             45000 non-null  float64
 10  cb_person_cred_hist_length      45000 non-null  float64
 11  credit_score                    45000 non-null  int64
 12  previous_loan_defaults_on_file  45000 non-null  object
 13  loan_status                     45000 non-null  int64
dtypes: float64(6), int64(3), object(5)
memory usage: 4.8+ MB